jlpoltrack/stm32ll-lib/src/stdstm32-peripherals.h
//*******************************************************
// Copyright (c) OlliW, OlliW42, www.olliw.eu
// GPL3
// https://www.gnu.org/licenses/gpl-3.0.de.html
//*******************************************************
// PERIPHERALS standard library
//*******************************************************
#ifndef STDSTM32_PERIPHERALS_H
#define STDSTM32_PERIPHERALS_H
#ifdef __cplusplus
extern "C" {
#endif


//-------------------------------------------------------
// C5 (HAL2) compatibility
//-------------------------------------------------------
// The C5 driver package dropped FunctionalState, which on every other family comes from the
// CMSIS device header. Higher level code passes ENABLE/DISABLE around, so provide it.

#if defined STM32C5
typedef enum {
  DISABLE = 0,
  ENABLE = !DISABLE,
} FunctionalState;

// the register access macros were all renamed with an STM32_ prefix
#ifndef SET_BIT
#define SET_BIT(REG, BIT)       STM32_SET_BIT(REG, BIT)
#define CLEAR_BIT(REG, BIT)     STM32_CLEAR_BIT(REG, BIT)
#define READ_BIT(REG, BIT)      STM32_READ_BIT(REG, BIT)
#define CLEAR_REG(REG)          STM32_CLEAR_REG(REG)
#define WRITE_REG(REG, VAL)     STM32_WRITE_REG(REG, VAL)
#define READ_REG(REG)           STM32_READ_REG(REG)
#define MODIFY_REG(REG, C, S)   STM32_MODIFY_REG(REG, C, S)
#define POSITION_VAL(VAL)       STM32_POSITION_VAL(VAL)
#endif
#endif


//-------------------------------------------------------
// NVIC
//-------------------------------------------------------

static inline void nvic_irq_enable_w_priority(IRQn_Type IRQn, uint32_t priority)
{
  // we do not do
  // NVIC_SetPriority(IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 13, 0));
  // as we want to use 0..15 as consequtive numbers
  NVIC_SetPriority(IRQn, priority);
  NVIC_EnableIRQ(IRQn); // works only for IRQn >= 0
}


//-------------------------------------------------------
// RCC
//-------------------------------------------------------

void rcc_init_afio(void)
{
#ifdef STM32F1
  LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_AFIO);
#endif
}


void rcc_init_gpio(GPIO_TypeDef* GPIOx)
{
#if defined STM32F1
  if (GPIOx == GPIOA) { LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_GPIOA); }
  if (GPIOx == GPIOB) { LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_GPIOB); }
  if (GPIOx == GPIOC) { LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_GPIOC); }
#if defined(GPIOD)
  if (GPIOx == GPIOD) { LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_GPIOD); }
#endif  
#if defined(GPIOE)
  if (GPIOx == GPIOE) { LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_GPIOE); }
#endif  

#elif defined STM32F3
  if (GPIOx == GPIOA) { LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOA); }
  if (GPIOx == GPIOB) { LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOB); }
  if (GPIOx == GPIOC) { LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOC); }
#if defined(GPIOD)
  if (GPIOx == GPIOD) { LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOD); }
#endif
#if defined(GPIOE)
  if (GPIOx == GPIOE) { LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOE); }
#endif
#if defined(GPIOF)
  if (GPIOx == GPIOF) { LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOF); }
#endif
#if defined(GPIOG)
  if (GPIOx == GPIOG) { LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOG); }
#endif

#elif defined STM32F7
  if (GPIOx == GPIOA) { LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOA); }
  if (GPIOx == GPIOB) { LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOB); }
  if (GPIOx == GPIOC) { LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOC); }
#if defined(GPIOD)
  if (GPIOx == GPIOD) { LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOD); }
#endif
#if defined(GPIOE)
  if (GPIOx == GPIOE) { LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOE); }
#endif
#if defined(GPIOF)
  if (GPIOx == GPIOF) { LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOF); }
#endif
#if defined(GPIOG)
  if (GPIOx == GPIOG) { LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOG); }
#endif

#elif defined STM32G4 || defined STM32L4
  if (GPIOx == GPIOA) { LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOA); }
  if (GPIOx == GPIOB) { LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOB); }
  if (GPIOx == GPIOC) { LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOC); }
#if defined(GPIOD)
  if (GPIOx == GPIOD) { LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOD); }
#endif  
#if defined(GPIOE)
  if (GPIOx == GPIOE) { LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOE); }
#endif  
#if defined(GPIOF)
  if (GPIOx == GPIOF) { LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOF); }
#endif
#if defined(GPIOG)
  if (GPIOx == GPIOG) { LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOG); }
#endif

#elif defined STM32WL
  if (GPIOx == GPIOA) { LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOA); }
  if (GPIOx == GPIOB) { LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOB); }
  if (GPIOx == GPIOC) { LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOC); }
  if (GPIOx == GPIOH) { LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOH); }

#elif defined STM32F0
  if (GPIOx == GPIOA) { LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOA); }
  if (GPIOx == GPIOB) { LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOB); }
  if (GPIOx == GPIOC) { LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOC); }
#if defined(GPIOD)
  if (GPIOx == GPIOD) { LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOD); }
#endif
#if defined(GPIOE)
  if (GPIOx == GPIOE) { LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOE); }
#endif
  if (GPIOx == GPIOF) { LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOF); }

#elif defined STM32C5
  if (GPIOx == GPIOA) { LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOA); }
  if (GPIOx == GPIOB) { LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOB); }
  if (GPIOx == GPIOC) { LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOC); }
#if defined(GPIOD)
  if (GPIOx == GPIOD) { LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOD); }
#endif
#if defined(GPIOE)
  if (GPIOx == GPIOE) { LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOE); }
#endif
#if defined(GPIOF)
  if (GPIOx == GPIOF) { LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOF); }
#endif
#if defined(GPIOH)
  if (GPIOx == GPIOH) { LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOH); }
#endif

#endif
}


