jlpoltrack/stm32ll-lib/src/stdstm32-peripherals.h
void rcc_init_tim(TIM_TypeDef* TIMx)
{
#if defined(TIM1)
  #ifndef STM32F0
  if (TIMx == TIM1) { LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_TIM1); }
  #else
  if (TIMx == TIM1) { LL_APB1_GRP2_EnableClock(LL_APB1_GRP2_PERIPH_TIM1); }
  #endif
#endif
#if defined(TIM2)
  if (TIMx == TIM2) { LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_TIM2); }
#endif
#if defined(TIM3)
  if (TIMx == TIM3) { LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_TIM3); }
#endif
#if defined(TIM4)
  if (TIMx == TIM4) { LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_TIM4); }
#endif
#if defined(TIM5)
  if (TIMx == TIM5) { LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_TIM5); }
#endif
#if defined(TIM6)
  if (TIMx == TIM6) { LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_TIM6); }
#endif
#if defined(TIM7)
  if (TIMx == TIM7) { LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_TIM7); }
#endif
#if defined(TIM8)
  if (TIMx == TIM8) { LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_TIM8); }
#endif
#if defined(TIM15)
  #ifndef STM32F0
  if (TIMx == TIM15) { LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_TIM15); }
  #else
  if (TIMx == TIM15) { LL_APB1_GRP2_EnableClock(LL_APB1_GRP2_PERIPH_TIM15); }
  #endif
#endif
#if defined(TIM16)
  #ifndef STM32F0
  if (TIMx == TIM16) { LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_TIM16); }
  #else
  if (TIMx == TIM16) { LL_APB1_GRP2_EnableClock(LL_APB1_GRP2_PERIPH_TIM16); }
  #endif
#endif
#if defined(TIM17)
  #ifndef STM32F0
  if (TIMx == TIM17) { LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_TIM17); }
  #else
  if (TIMx == TIM17) { LL_APB1_GRP2_EnableClock(LL_APB1_GRP2_PERIPH_TIM17); }
  #endif
#endif
}


#if defined LPTIM1 || defined LPTIM2 || defined LPTIM3

void rcc_init_lptim(LPTIM_TypeDef* LPTIMx)
{
#if defined(LPTIM1)
  // C5 puts LPTIM1 on APB3, like it does LPUART1
#if defined STM32C5
  if (LPTIMx == LPTIM1) { LL_APB3_GRP1_EnableClock(LL_APB3_GRP1_PERIPH_LPTIM1); }
#else
  if (LPTIMx == LPTIM1) { LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_LPTIM1); }
#endif
#endif
#if defined(LPTIM2)
  if (LPTIMx == LPTIM2) { LL_APB1_GRP2_EnableClock(LL_APB1_GRP2_PERIPH_LPTIM2); }
#endif
#if defined(LPTIM3)
  if (LPTIMx == LPTIM3) { LL_APB1_GRP2_EnableClock(LL_APB1_GRP2_PERIPH_LPTIM3); }
#endif
}

#endif


void rcc_init_uart(USART_TypeDef* USARTx)
{
#if defined(USART1)
  #ifndef STM32F0
  if (USARTx == USART1) { LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_USART1); }
  #else
  if (USARTx == USART1) { LL_APB1_GRP2_EnableClock(LL_APB1_GRP2_PERIPH_USART1); }
  #endif
#endif
#if defined(USART2)
  if (USARTx == USART2) { LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_USART2); }
#endif
#if defined(USART3)
  if (USARTx == USART3) { LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_USART3); }
#endif
#if defined(UART4)
  if (USARTx == UART4)  { LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_UART4); }
#endif
#if defined(UART5)
  if (USARTx == UART5)  { LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_UART5); }
#endif
#if defined(USART6)
  if (USARTx == USART6) { LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_USART6); }
#endif
#if defined(UART7)
  if (USARTx == UART7)  { LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_UART7); }
#endif
#if defined(UART8)
  if (USARTx == UART8)  { LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_UART8); }
#endif

#if defined(LPUART1)
  #if defined STM32C5
  if (USARTx == LPUART1) { LL_APB3_GRP1_EnableClock(LL_APB3_GRP1_PERIPH_LPUART1); }
  #elif defined STM32G4 || defined STM32L4 || defined STM32WL
  if (USARTx == LPUART1) { LL_APB1_GRP2_EnableClock(LL_APB1_GRP2_PERIPH_LPUART1); }
  #else
    #error LPUART1 bus mapping not configured for this family
  #endif
#endif
}


void rcc_init_spi(SPI_TypeDef* SPIx)
{
#if defined(SPI1)
  #ifndef STM32F0
  if (SPIx == SPI1) { LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_SPI1); }
  #else
  if (SPIx == SPI1) { LL_APB1_GRP2_EnableClock(LL_APB1_GRP2_PERIPH_SPI1); }
  #endif
#endif
#if defined(SPI2)
  if (SPIx == SPI2) { LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_SPI2); }
#endif
#if defined(SPI3)
  if (SPIx == SPI3) { LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_SPI3); }
#endif

#if defined(SUBGHZSPI)
  if (SPIx == SUBGHZSPI) { LL_APB3_GRP1_EnableClock(LL_APB3_GRP1_PERIPH_SUBGHZSPI); }
#endif
}


void rcc_init_adc(ADC_TypeDef* ADCx)
{
#if defined STM32F1 || defined STM32F7
#if defined(ADC1)
  if (ADCx == ADC1) { LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_ADC1); }
#endif
#if defined(ADC2)
  if (ADCx == ADC2) { LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_ADC2); }
#endif
#if defined(ADC3)
  if (ADCx == ADC3) { LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_ADC3); }
#endif

#elif defined STM32F3
#if defined(ADC1)
  #warning F3 ADC1 still TODO
#endif
#if defined(ADC2)
  if (ADCx == ADC2) { LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_ADC12); }
#endif
#if defined(ADC3)
  if (ADCx == ADC3) { LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_ADC34); }
#endif
#if defined(ADC4)
  if (ADCx == ADC4) { LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_ADC34); }
#endif

#elif defined STM32G4
#if defined(ADC1)
  if (ADCx == ADC1) { LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_ADC12); }
#endif
#if defined(ADC2)
  if (ADCx == ADC2) { LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_ADC12); }
#endif
#if defined(ADC3)
  if (ADCx == ADC3) { LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_ADC345); }
#endif

#elif defined STM32L4
#if defined(ADC1)
  if (ADCx == ADC1) { LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_ADC); }
#endif

#elif defined STM32WL
#if defined(ADC)
  if (ADCx == ADC) { LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_ADC); }
#endif

#elif defined STM32F0
#if defined(ADC1)
  if (ADCx == ADC1) { LL_APB1_GRP2_EnableClock(LL_APB1_GRP2_PERIPH_ADC1); }
#endif

#elif defined STM32C5
#if defined(ADC1)
  if (ADCx == ADC1) { LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_ADC12); }
#endif

#endif
}


#if defined DAC1

void rcc_init_dac(DAC_TypeDef* DACx)
{
#if defined STM32F3
#if defined(DAC1)
  if (DACx == DAC1) { LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_DAC1); }
#endif
#endif
#if defined STM32C5
#if defined(DAC1)
  if (DACx == DAC1) { LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_DAC1); }
#endif
#endif
}

#endif


void rcc_init_dma(DMA_TypeDef* DMAx)
{
#if defined(LL_AHB1_GRP1_PERIPH_DMAMUX1)
  LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_DMAMUX1);
#endif

#if defined(DMA1)
  if (DMAx == DMA1) { LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_DMA1); }
#endif
#if defined(DMA2)
  if (DMAx == DMA2) { LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_DMA2); }
#endif
}


//-------------------------------------------------------
// GPIO
//-------------------------------------------------------

