jlpoltrack/stm32ll-lib/src/stdstm32-peripherals.h
#if defined(GPIOA)
#define IO_PA0   GPIOA, LL_GPIO_PIN_0
#define IO_PA1   GPIOA, LL_GPIO_PIN_1
#define IO_PA2   GPIOA, LL_GPIO_PIN_2
#define IO_PA3   GPIOA, LL_GPIO_PIN_3
#define IO_PA4   GPIOA, LL_GPIO_PIN_4
#define IO_PA5   GPIOA, LL_GPIO_PIN_5
#define IO_PA6   GPIOA, LL_GPIO_PIN_6
#define IO_PA7   GPIOA, LL_GPIO_PIN_7

#define IO_PA8   GPIOA, LL_GPIO_PIN_8
#define IO_PA9   GPIOA, LL_GPIO_PIN_9
#define IO_PA10  GPIOA, LL_GPIO_PIN_10
#define IO_PA11  GPIOA, LL_GPIO_PIN_11
#define IO_PA12  GPIOA, LL_GPIO_PIN_12
#define IO_PA13  GPIOA, LL_GPIO_PIN_13
#define IO_PA14  GPIOA, LL_GPIO_PIN_14
#define IO_PA15  GPIOA, LL_GPIO_PIN_15
#endif

#if defined(GPIOB)
#define IO_PB0   GPIOB, LL_GPIO_PIN_0
#define IO_PB1   GPIOB, LL_GPIO_PIN_1
#define IO_PB2   GPIOB, LL_GPIO_PIN_2
#define IO_PB3   GPIOB, LL_GPIO_PIN_3
#define IO_PB4   GPIOB, LL_GPIO_PIN_4
#define IO_PB5   GPIOB, LL_GPIO_PIN_5
#define IO_PB6   GPIOB, LL_GPIO_PIN_6
#define IO_PB7   GPIOB, LL_GPIO_PIN_7

#define IO_PB8   GPIOB, LL_GPIO_PIN_8
#define IO_PB9   GPIOB, LL_GPIO_PIN_9
#define IO_PB10  GPIOB, LL_GPIO_PIN_10
#define IO_PB11  GPIOB, LL_GPIO_PIN_11
#define IO_PB12  GPIOB, LL_GPIO_PIN_12
#define IO_PB13  GPIOB, LL_GPIO_PIN_13
#define IO_PB14  GPIOB, LL_GPIO_PIN_14
#define IO_PB15  GPIOB, LL_GPIO_PIN_15
#endif

#if defined(GPIOC)
#define IO_PC0   GPIOC, LL_GPIO_PIN_0
#define IO_PC1   GPIOC, LL_GPIO_PIN_1
#define IO_PC2   GPIOC, LL_GPIO_PIN_2
#define IO_PC3   GPIOC, LL_GPIO_PIN_3
#define IO_PC4   GPIOC, LL_GPIO_PIN_4
#define IO_PC5   GPIOC, LL_GPIO_PIN_5
#define IO_PC6   GPIOC, LL_GPIO_PIN_6
#define IO_PC7   GPIOC, LL_GPIO_PIN_7

#define IO_PC8   GPIOC, LL_GPIO_PIN_8
#define IO_PC9   GPIOC, LL_GPIO_PIN_9
#define IO_PC10  GPIOC, LL_GPIO_PIN_10
#define IO_PC11  GPIOC, LL_GPIO_PIN_11
#define IO_PC12  GPIOC, LL_GPIO_PIN_12
#define IO_PC13  GPIOC, LL_GPIO_PIN_13
#define IO_PC14  GPIOC, LL_GPIO_PIN_14
#define IO_PC15  GPIOC, LL_GPIO_PIN_15
#endif

#if defined(GPIOD)
#define IO_PD0   GPIOD, LL_GPIO_PIN_0
#define IO_PD1   GPIOD, LL_GPIO_PIN_1
#define IO_PD2   GPIOD, LL_GPIO_PIN_2
#define IO_PD5   GPIOD, LL_GPIO_PIN_5
#define IO_PD6   GPIOD, LL_GPIO_PIN_6
#define IO_PD7   GPIOD, LL_GPIO_PIN_7

#define IO_PD8   GPIOD, LL_GPIO_PIN_8
#define IO_PD9   GPIOD, LL_GPIO_PIN_9
#define IO_PD10  GPIOD, LL_GPIO_PIN_10
#define IO_PD11  GPIOD, LL_GPIO_PIN_11
#define IO_PD12  GPIOD, LL_GPIO_PIN_12
#define IO_PD13  GPIOD, LL_GPIO_PIN_13
#define IO_PD14  GPIOD, LL_GPIO_PIN_14
#define IO_PD15  GPIOD, LL_GPIO_PIN_15
#endif

#if defined(GPIOE)
#define IO_PE0   GPIOE, LL_GPIO_PIN_0
#define IO_PE1   GPIOE, LL_GPIO_PIN_1
#define IO_PE2   GPIOE, LL_GPIO_PIN_2
#define IO_PE3   GPIOE, LL_GPIO_PIN_3
#define IO_PE4   GPIOE, LL_GPIO_PIN_4
#define IO_PE5   GPIOE, LL_GPIO_PIN_5
#define IO_PE6   GPIOE, LL_GPIO_PIN_6
#define IO_PE7   GPIOE, LL_GPIO_PIN_7
#define IO_PE8   GPIOE, LL_GPIO_PIN_8
#define IO_PE9   GPIOE, LL_GPIO_PIN_9
#endif

#if defined(GPIOF)
#define IO_PF3   GPIOF, LL_GPIO_PIN_3
#define IO_PF5   GPIOF, LL_GPIO_PIN_5
#define IO_PF6   GPIOF, LL_GPIO_PIN_6
#define IO_PF7   GPIOF, LL_GPIO_PIN_7
#endif

#if defined(GPIOG)
#define IO_PG0   GPIOG, LL_GPIO_PIN_0
#define IO_PG9   GPIOG, LL_GPIO_PIN_9
#define IO_PG14  GPIOG, LL_GPIO_PIN_14
#endif

#if defined(GPIOH)
#define IO_PH0   GPIOH, LL_GPIO_PIN_0
#endif


typedef enum {
  IO_MODE_Z = 0,
  IO_MODE_INPUT_ANALOG, // use for ADC
  IO_MODE_INPUT_PD,
  IO_MODE_INPUT_PU,
  IO_MODE_OUTPUT_PP,
  IO_MODE_OUTPUT_PP_LOW,
  IO_MODE_OUTPUT_PP_HIGH,
  IO_MODE_OUTPUT_OD,
  IO_MODE_OUTPUT_OD_LOW,
  IO_MODE_OUTPUT_OD_HIGH,
  IO_MODE_OUTPUT_ALTERNATE_PP,
  IO_MODE_OUTPUT_ALTERNATE_OD,
} IOMODEENUM;


typedef enum {
  IO_SPEED_DEFAULT = 0,
  IO_SPEED_SLOW,
  IO_SPEED_FAST,
  IO_SPEED_VERYFAST,
} IOSPEEDENUM;


typedef enum {
  IO_AF_DEFAULT = 0,
  IO_AF_0, IO_AF_1, IO_AF_2, IO_AF_3, IO_AF_4, IO_AF_5, IO_AF_6, IO_AF_7,
  IO_AF_8, IO_AF_9, IO_AF_10, IO_AF_11, IO_AF_12,  IO_AF_13, IO_AF_14, IO_AF_15,
} IOAFENUM;


typedef enum { // just for convenience to use in higher level code
  IO_LOW = 0,
  IO_HIGH,
} IOSTATEENUM;


GPIO_TypeDef* IO_GPIOx(GPIO_TypeDef* GPIOx, uint32_t GPIO_Pin) { return GPIOx; }
uint32_t IO_PINx(GPIO_TypeDef* GPIOx, uint32_t GPIO_Pin) { return GPIO_Pin; }


#if defined STM32C5
// The C5 driver package (HAL2) dropped the aggregate LL initializers, so there is no
// LL_GPIO_Init()/LL_GPIO_InitTypeDef, only per-attribute setters. Shim them so the body of
// _gpio_init() below stays family-neutral. Zero-init is safe: PULL_NO and PUSHPULL are both 0.
typedef struct {
  uint32_t Pin;
  uint32_t Mode;
  uint32_t Speed;
  uint32_t OutputType;
  uint32_t Pull;
  uint32_t Alternate;
} LL_GPIO_InitTypeDef;

void LL_GPIO_Init(GPIO_TypeDef* GPIOx, LL_GPIO_InitTypeDef* ini)
{
  for (uint32_t pins = ini->Pin; pins; pins &= pins - 1) {
    uint32_t pin = pins & (~pins + 1); // isolate lowest set bit, one LL_GPIO_PIN_x

    if (ini->Mode == LL_GPIO_MODE_ALTERNATE) { // set the AF before switching the mode over
      if (pin < LL_GPIO_PIN_8) {
        LL_GPIO_SetAFPin_0_7(GPIOx, pin, ini->Alternate);
      } else {
        LL_GPIO_SetAFPin_8_15(GPIOx, pin, ini->Alternate);
      }
    }
    LL_GPIO_SetPinSpeed(GPIOx, pin, ini->Speed);
    LL_GPIO_SetPinOutputType(GPIOx, pin, ini->OutputType);
    LL_GPIO_SetPinPull(GPIOx, pin, ini->Pull);
    LL_GPIO_SetPinMode(GPIOx, pin, ini->Mode); // mode last, it is what activates the pin
  }
}
#endif


void _gpio_init(GPIO_TypeDef* GPIOx, uint32_t GPIO_Pin, IOMODEENUM mode, IOSPEEDENUM speed, IOAFENUM af, uint8_t init_rcc)
{
LL_GPIO_InitTypeDef GPIO_InitStruct = {};

  GPIO_InitStruct.Pin = GPIO_Pin;

  switch (mode) {
    case IO_MODE_Z:
      GPIO_InitStruct.Mode = LL_GPIO_MODE_ANALOG;
      break;
    case IO_MODE_INPUT_ANALOG:
      GPIO_InitStruct.Mode = LL_GPIO_MODE_ANALOG;
      break;
    case IO_MODE_INPUT_PD:
      GPIO_InitStruct.Mode = LL_GPIO_MODE_INPUT;
      GPIO_InitStruct.Pull = LL_GPIO_PULL_DOWN;
      break;
    case IO_MODE_INPUT_PU:
      GPIO_InitStruct.Mode = LL_GPIO_MODE_INPUT;
      GPIO_InitStruct.Pull = LL_GPIO_PULL_UP;
      break;
    case IO_MODE_OUTPUT_PP: case IO_MODE_OUTPUT_PP_LOW: case IO_MODE_OUTPUT_PP_HIGH:
      GPIO_InitStruct.Mode = LL_GPIO_MODE_OUTPUT;
      GPIO_InitStruct.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
      break;
    case IO_MODE_OUTPUT_OD: case IO_MODE_OUTPUT_OD_LOW: case IO_MODE_OUTPUT_OD_HIGH:
      GPIO_InitStruct.Mode = LL_GPIO_MODE_OUTPUT;
      GPIO_InitStruct.OutputType = LL_GPIO_OUTPUT_OPENDRAIN;
      break;
    case IO_MODE_OUTPUT_ALTERNATE_PP:
      GPIO_InitStruct.Mode = LL_GPIO_MODE_ALTERNATE;
      GPIO_InitStruct.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
      break;
    case IO_MODE_OUTPUT_ALTERNATE_OD:
      GPIO_InitStruct.Mode = LL_GPIO_MODE_ALTERNATE;
      GPIO_InitStruct.OutputType = LL_GPIO_OUTPUT_OPENDRAIN;
      break;
    default: while (1) {}
  }

