jlpoltrack/stm32ll-lib/src/stdstm32-peripherals.h
  switch (speed) {
    case IO_SPEED_DEFAULT: GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_HIGH; break;
    case IO_SPEED_SLOW: GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_LOW; break;
    case IO_SPEED_FAST: GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_MEDIUM; break;
    case IO_SPEED_VERYFAST: GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_HIGH; break;
    default: while (1) {}
  }

#if defined STM32F7 || defined STM32G4 || defined STM32F3 || defined STM32L4 || defined STM32WL || defined STM32F0 || defined STM32C5
  switch (af) {
    case IO_AF_DEFAULT: GPIO_InitStruct.Alternate = LL_GPIO_AF_0; break;
    case IO_AF_0: GPIO_InitStruct.Alternate = LL_GPIO_AF_0; break;
    case IO_AF_1: GPIO_InitStruct.Alternate = LL_GPIO_AF_1; break;
    case IO_AF_2: GPIO_InitStruct.Alternate = LL_GPIO_AF_2; break;
    case IO_AF_3: GPIO_InitStruct.Alternate = LL_GPIO_AF_3; break;
    case IO_AF_4: GPIO_InitStruct.Alternate = LL_GPIO_AF_4; break;
    case IO_AF_5: GPIO_InitStruct.Alternate = LL_GPIO_AF_5; break;
    case IO_AF_6: GPIO_InitStruct.Alternate = LL_GPIO_AF_6; break;
    case IO_AF_7: GPIO_InitStruct.Alternate = LL_GPIO_AF_7; break;
#if defined LL_GPIO_AF_8 // assume that if AF_8 is available, all up to AF_15 are available too
    case IO_AF_8: GPIO_InitStruct.Alternate = LL_GPIO_AF_8; break;
    case IO_AF_9: GPIO_InitStruct.Alternate = LL_GPIO_AF_9; break;
    case IO_AF_10: GPIO_InitStruct.Alternate = LL_GPIO_AF_10; break;
    case IO_AF_11: GPIO_InitStruct.Alternate = LL_GPIO_AF_11; break;
    case IO_AF_12: GPIO_InitStruct.Alternate = LL_GPIO_AF_12; break;
    case IO_AF_13: GPIO_InitStruct.Alternate = LL_GPIO_AF_13; break;
    case IO_AF_14: GPIO_InitStruct.Alternate = LL_GPIO_AF_14; break;
    case IO_AF_15: GPIO_InitStruct.Alternate = LL_GPIO_AF_15; break;
#endif
    default: while (1) {}
  }
  if (af > IO_AF_DEFAULT) {
    GPIO_InitStruct.Mode = LL_GPIO_MODE_ALTERNATE;
  }
#endif

  if (init_rcc) rcc_init_gpio(GPIOx);

  switch (mode) {
    case IO_MODE_OUTPUT_PP_LOW: case IO_MODE_OUTPUT_OD_LOW:
      LL_GPIO_ResetOutputPin(GPIOx, GPIO_Pin);
      break;
    case IO_MODE_OUTPUT_PP_HIGH: case IO_MODE_OUTPUT_OD_HIGH:
      LL_GPIO_SetOutputPin(GPIOx, GPIO_Pin);
      break;
    default:
      break;
  }

  LL_GPIO_Init(GPIOx, &GPIO_InitStruct);
}


static inline void gpio_init(GPIO_TypeDef* GPIOx, uint32_t GPIO_Pin, IOMODEENUM mode, IOSPEEDENUM speed)
{
  _gpio_init(GPIOx, GPIO_Pin, mode, speed, IO_AF_DEFAULT, 1);
}


static inline void gpio_change(GPIO_TypeDef* GPIOx, uint32_t GPIO_Pin, IOMODEENUM mode, IOSPEEDENUM speed)
{
  _gpio_init(GPIOx, GPIO_Pin, mode, speed, IO_AF_DEFAULT, 0);
}


static inline void gpio_deinit(GPIO_TypeDef* GPIOx, uint32_t GPIO_Pin, IOMODEENUM mode, IOSPEEDENUM speed)
{
  _gpio_init(GPIOx, GPIO_Pin, mode, speed, IO_AF_DEFAULT, 0);
}


static inline void gpio_init_af(GPIO_TypeDef* GPIOx, uint32_t GPIO_Pin, IOMODEENUM mode, IOAFENUM af, IOSPEEDENUM speed)
{
  _gpio_init(GPIOx, GPIO_Pin, mode, speed, af, 1);
}


static inline void gpio_change_af(GPIO_TypeDef* GPIOx, uint32_t GPIO_Pin, IOMODEENUM mode, IOAFENUM af, IOSPEEDENUM speed)
{
  _gpio_init(GPIOx, GPIO_Pin, mode, speed, af, 0);
}


static inline void gpio_init_outpp(GPIO_TypeDef* GPIOx, uint32_t GPIO_Pin)
{
  _gpio_init(GPIOx, GPIO_Pin, IO_MODE_OUTPUT_PP, IO_SPEED_DEFAULT, IO_AF_DEFAULT, 1);
}


#define GPIO_INLINE_FORCED static inline __attribute__ ((always_inline))


// these should be fast
#pragma GCC push_options
#pragma GCC optimize ("O3")

GPIO_INLINE_FORCED void gpio_low(GPIO_TypeDef* GPIOx, uint32_t GPIO_Pin)
{
  LL_GPIO_ResetOutputPin(GPIOx, GPIO_Pin);
}


GPIO_INLINE_FORCED void gpio_high(GPIO_TypeDef* GPIOx, uint32_t GPIO_Pin)
{
  LL_GPIO_SetOutputPin(GPIOx, GPIO_Pin);
}


GPIO_INLINE_FORCED void gpio_toggle(GPIO_TypeDef* GPIOx, uint32_t GPIO_Pin)
{
  LL_GPIO_TogglePin(GPIOx, GPIO_Pin);
}


GPIO_INLINE_FORCED uint16_t gpio_read_activehigh(GPIO_TypeDef* GPIOx, uint32_t GPIO_Pin)
{
  return (LL_GPIO_IsInputPinSet(GPIOx, GPIO_Pin)) ? 1 : 0;
}


GPIO_INLINE_FORCED uint16_t gpio_read_activelow(GPIO_TypeDef* GPIOx, uint32_t GPIO_Pin)
{
  return (!LL_GPIO_IsInputPinSet(GPIOx, GPIO_Pin)) ? 1 : 0;
}


GPIO_INLINE_FORCED uint16_t gpio_readoutput(GPIO_TypeDef* GPIOx, uint32_t GPIO_Pin)
{
  return (LL_GPIO_IsOutputPinSet(GPIOA, GPIO_Pin)) ? 1 : 0;
}

#pragma GCC pop_options
// end of these should be fast


//-------------------------------------------------------
// GPIO auxiliary defines
//-------------------------------------------------------
// these are here just for use in some hal's etc

#define PIN_PA0   0x000
#define PIN_PA1   0x001
#define PIN_PA2   0x002
#define PIN_PA3   0x003
#define PIN_PA4   0x004
#define PIN_PA5   0x005
#define PIN_PA6   0x006
#define PIN_PA7   0x007
#define PIN_PA8   0x008
#define PIN_PA9   0x009
#define PIN_PA10  0x010
#define PIN_PA11  0x011
#define PIN_PA12  0x012
#define PIN_PA13  0x013
#define PIN_PA14  0x014
#define PIN_PA15  0x015

#define PIN_PB0   0x100
#define PIN_PB1   0x101
#define PIN_PB2   0x102
#define PIN_PB3   0x103
#define PIN_PB4   0x104
#define PIN_PB5   0x105
#define PIN_PB6   0x106
#define PIN_PB7   0x107
#define PIN_PB8   0x108
#define PIN_PB9   0x109
#define PIN_PB10  0x110
#define PIN_PB11  0x111
#define PIN_PB12  0x112
#define PIN_PB13  0x113
#define PIN_PB14  0x114
#define PIN_PB15  0x115


//-------------------------------------------------------
// Timer
//-------------------------------------------------------

typedef enum {
  TIMER_BASE_1US = 0,
  TIMER_BASE_1MHZ = TIMER_BASE_1US,
#if defined STM32F1 || defined STM32F3 || defined STM32WL || defined STM32F0
  TIMER_BASE_8MHZ,
#endif
#if defined STM32G4 || defined STM32L4
  TIMER_BASE_10MHZ,
#endif
  TIMER_BASE_18MHZ, // this may be achieved only approximate depending on the STM32
  TIMER_BASE_10US,
  TIMER_BASE_MAX,
} TIMERBASEENUM;


// helper to correct for timer base clock
uint16_t _tim_devider(TIM_TypeDef* TIMx)
{
#if defined STM32F1 // all timer run on 72 MHz
  return 1;

#elif defined STM32F3 // all timer run on 72 MHz
  return 1;

#elif defined STM32F7
// for F722, timers on APB1 run with 108 MHz and those on APB2 run with 216 MHz
// TIM1, TIM8 are on APB2 and run with 216 MHz
// the other run with 108 MHz
#if defined(TIM2)
  if (TIMx == TIM2) return 2;
#endif
#if defined(TIM3)
  if (TIMx == TIM3) return 2;
#endif
#if defined(TIM4)
  if (TIMx == TIM4) return 2;
#endif
#if defined(TIM5)
  if (TIMx == TIM5) return 2;
#endif
  return 1;

#elif defined STM32G4 // all timer run on 170 MHz
  return 1;

#elif defined STM32L4 // all timer run on 80 MHz
  return 1;

#elif defined STM32WL || defined STM32F0 // all timer run on 48 MHz
  return 1;

#elif defined STM32C5 // all timer run on 144 MHz
  return 1;

#endif
}


#if defined STM32C5
// same story as LL_GPIO_Init() above: HAL2 has the per-attribute setters but no aggregate
// initializer. C5 also renamed LL_TIM_CLOCKSOURCE_INTERNAL.
#define LL_TIM_CLOCKSOURCE_INTERNAL  LL_TIM_CLK_INTERNAL

