jlpoltrack/stm32ll-lib/src/stdstm32-peripherals.h
typedef struct {
  uint16_t Prescaler;
  uint32_t CounterMode;
  uint32_t Autoreload;
  uint32_t ClockDivision;
  uint8_t RepetitionCounter;
} LL_TIM_InitTypeDef;

void LL_TIM_Init(TIM_TypeDef* TIMx, LL_TIM_InitTypeDef* ini)
{
  LL_TIM_SetCounterMode(TIMx, ini->CounterMode);
  LL_TIM_SetAutoReload(TIMx, ini->Autoreload);
  LL_TIM_SetPrescaler(TIMx, ini->Prescaler);
  if (IS_TIM_CLOCK_DIVISION_INSTANCE(TIMx)) LL_TIM_SetClockDivision(TIMx, ini->ClockDivision);
  if (IS_TIM_REPETITION_COUNTER_INSTANCE(TIMx)) LL_TIM_SetRepetitionCounter(TIMx, ini->RepetitionCounter);
  LL_TIM_GenerateEvent_UPDATE(TIMx); // load the prescaler, as ST's own LL_TIM_Init() does
}


typedef struct {
  uint32_t OCMode;
  uint32_t OCState;
  uint32_t OCNState;
  uint32_t CompareValue;
  uint32_t OCPolarity;
  uint32_t OCNPolarity;
  uint32_t OCIdleState;
  uint32_t OCNIdleState;
} LL_TIM_OC_InitTypeDef;

void LL_TIM_OC_Init(TIM_TypeDef* TIMx, uint32_t Channel, LL_TIM_OC_InitTypeDef* ini)
{
  LL_TIM_OC_SetMode(TIMx, Channel, ini->OCMode);
  LL_TIM_OC_SetPolarity(TIMx, Channel, ini->OCPolarity);

  switch (Channel) {
    case LL_TIM_CHANNEL_CH1: LL_TIM_OC_SetCompareCH1(TIMx, ini->CompareValue); break;
    case LL_TIM_CHANNEL_CH2: LL_TIM_OC_SetCompareCH2(TIMx, ini->CompareValue); break;
    case LL_TIM_CHANNEL_CH3: LL_TIM_OC_SetCompareCH3(TIMx, ini->CompareValue); break;
    case LL_TIM_CHANNEL_CH4: LL_TIM_OC_SetCompareCH4(TIMx, ini->CompareValue); break;
    default: break;
  }

  // mLRS uses the compare units to raise interrupts, not to drive pins, so OCState is
  // normally left at 0 = output off
  if (ini->OCState) {
    LL_TIM_CC_EnableChannel(TIMx, Channel);
  } else {
    LL_TIM_CC_DisableChannel(TIMx, Channel);
  }
}
#endif


// do not enable timer
void tim_config_up(TIM_TypeDef* TIMx, uint32_t period, TIMERBASEENUM rate)
{
LL_TIM_InitTypeDef TIM_InitStruct = {};

  rcc_init_tim(TIMx);

  // figure it out
  uint16_t prescaler = 0;
  switch (rate) {
    case TIMER_BASE_18MHZ:
      prescaler = (SystemCoreClock/18000000);
      prescaler /= _tim_devider(TIMx);
      break;
    case TIMER_BASE_1US:
      prescaler = (SystemCoreClock/1000000);
      prescaler /= _tim_devider(TIMx);
      break;
#if defined STM32F1 || defined STM32F3 || defined STM32WL || defined STM32F0
    case TIMER_BASE_8MHZ:
      prescaler = (SystemCoreClock/1000000)/8;
      prescaler /= _tim_devider(TIMx);
      break;
#endif
#if defined STM32G4 || defined STM32L4
    case TIMER_BASE_10MHZ:
      prescaler = (SystemCoreClock/1000000)/10;
      prescaler /= _tim_devider(TIMx);
      break;
#endif
    case TIMER_BASE_10US:
      prescaler = (SystemCoreClock/1000000)*10;
      prescaler /= _tim_devider(TIMx);
      break;
    case TIMER_BASE_MAX:
      prescaler = 1;
      break;
    default:
      while (1) {};
  }

  // Configure time base
  TIM_InitStruct.ClockDivision = LL_TIM_CLOCKDIVISION_DIV1;
  TIM_InitStruct.CounterMode = LL_TIM_COUNTERMODE_UP;
  TIM_InitStruct.Autoreload = period; // this should work for both 16 and 32 bit timer
  TIM_InitStruct.RepetitionCounter = 0;
  TIM_InitStruct.Prescaler = prescaler - 1;
  LL_TIM_Init(TIMx, &TIM_InitStruct);

  LL_TIM_DisableARRPreload(TIMx);
  LL_TIM_SetClockSource(TIMx, LL_TIM_CLOCKSOURCE_INTERNAL);
  LL_TIM_SetTriggerOutput(TIMx, LL_TIM_TRGO_RESET);
#if defined(LL_TIM_TRGO2_RESET)
  LL_TIM_SetTriggerOutput2(TIMx, LL_TIM_TRGO2_RESET);
#endif
  LL_TIM_DisableMasterSlaveMode(TIMx);
}


void tim_config_1us(TIM_TypeDef* TIMx, uint32_t period)
{
  tim_config_up(TIMx, period, TIMER_BASE_1US);
}


void tim_config_1us_freerunning(TIM_TypeDef* TIMx)
{
  tim_config_up(TIMx, 0xFFFFFFFF, TIMER_BASE_1US); // works for both 16 and 32 bit timer
}


void tim_enable(TIM_TypeDef* TIMx)
{
  LL_TIM_EnableCounter(TIMx);
}


void tim_init_up(TIM_TypeDef* TIMx, uint32_t period, TIMERBASEENUM rate)
{
  tim_config_up(TIMx, period, rate);

  LL_TIM_EnableCounter(TIMx);
}


void tim_init_1us(TIM_TypeDef* TIMx, uint32_t period)
{
  tim_init_up(TIMx, period, TIMER_BASE_1US);
}


void tim_init_1us_freerunning(TIM_TypeDef* TIMx)
{
  tim_init_up(TIMx, 0xFFFFFFFF, TIMER_BASE_1US); // works for both 16 and 32 bit timer
}


//-------------------------------------------------------
#ifdef __cplusplus
}
#endif
#endif // STDSTM32_PERIPHERALS_H
